УНФ_ТЕСТ/src/Enums/ТипыСтруктурныхЕдиниц/ТипыСтруктурныхЕдиниц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСтруктурныхЕдиниц</name>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>Розница</name>
  </enumValues>
  <enumValues>
    <name>РозницаСуммовойУчет</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Catalogs/СтруктурныеЕдиницы/СтруктурныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктурныеЕдиницы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ОсновноеПодразделение</name>
      <description>Основное подразделение</description>
    </items>
    <items>
      <name>ОсновнойСклад</name>
      <description>Основной склад</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипСтруктурнойЕдиницы</name>
    <type>
      <types>EnumRef.ТипыСтруктурныхЕдиниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрдерныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМОЛ</name>
    <comment>Подпись материально-ответственного лица</comment>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРознице</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценки</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОтходов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяОтходов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойИндексОбособленногоПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УНФ_ТЕСТ/src/CommonForms/МенюФункцийНСИ/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФОУчетПоНесколькимОрганизациям = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	Элементы.ОткрытьОрганизации.Заголовок = ?(ФОУчетПоНесколькимОрганизациям, "Организации", "Организация");
	
	ФОУчетПоНесколькимСкладам = ПолучитьФункциональнуюОпцию("УчетПоНесколькимСкладам");
	Элементы.ОткрытьСклады.Заголовок = ?(ФОУчетПоНесколькимСкладам, "Склады", "Склад");
	
	ФОУчетПоНесколькимПодразделениям = ПолучитьФункциональнуюОпцию("УчетПоНесколькимПодразделениям");
	Элементы.ОткрытьПодразделения.Заголовок = ?(ФОУчетПоНесколькимПодразделениям, "Подразделения", "Подразделение");
	
	ФОУчетПоНесколькимНаправлениямДеятельности = ПолучитьФункциональнуюОпцию("УчетПоНесколькимНаправлениямДеятельности");
	Элементы.ОткрытьНаправленияДеятельности.Заголовок = ?(ФОУчетПоНесколькимНаправлениямДеятельности, "Направления деятельности", "Направление деятельности");
	
	ОсновнаяОрганизация = Справочники.Организации.ОрганизацияПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант" Тогда 
		
		Если Источник = "ИспользоватьНесколькоОрганизаций" Тогда
			
			ФОУчетПоНесколькимОрганизациям = ПолучитьФОСервер("ИспользоватьНесколькоОрганизаций");
			Элементы.ОткрытьОрганизации.Заголовок = ?(ФОУчетПоНесколькимОрганизациям, "Организации", "Организация");
			
		ИначеЕсли Источник = "ФункциональнаяОпцияУчетПоНесколькимСкладам" Тогда
			
			ФОУчетПоНесколькимСкладам = ПолучитьФОСервер("УчетПоНесколькимСкладам");
			Элементы.ОткрытьСклады.Заголовок = ?(ФОУчетПоНесколькимСкладам, "Склады", "Склад");
			
		ИначеЕсли Источник = "ФункциональнаяОпцияУчетПоНесколькимПодразделениям" Тогда
			
			ФОУчетПоНесколькимПодразделениям = ПолучитьФОСервер("УчетПоНесколькимПодразделениям");
			Элементы.ОткрытьПодразделения.Заголовок = ?(ФОУчетПоНесколькимПодразделениям, "Подразделения", "Подразделение");
			
		ИначеЕсли Источник = "ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности" Тогда
			
			ФОУчетПоНесколькимНаправлениямДеятельности = ПолучитьФОСервер("УчетПоНесколькимНаправлениямДеятельности");
			Элементы.ОткрытьНаправленияДеятельности.Заголовок = ?(ФОУчетПоНесколькимНаправлениямДеятельности, "Направления деятельности", "Направление деятельности");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОрганизации(Команда)
	
	Если ФОУчетПоНесколькимОрганизациям Тогда
		ОткрытьФорму("Справочник.Организации.ФормаСписка");
	Иначе
		ПараметрОрганизация = Новый Структура("Ключ", ОсновнаяОрганизация);
		ОткрытьФорму("Справочник.Организации.ФормаОбъекта", ПараметрОрганизация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСклады(Команда)
	
	Если ФОУчетПоНесколькимСкладам Тогда
		
		МассивОтбора = Новый Массив;
		МассивОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Склад"));
		МассивОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Розница"));
		МассивОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет"));
		
		СтруктураОтбора = Новый Структура("ТипСтруктурнойЕдиницы", МассивОтбора);
		
		ОткрытьФорму("Справочник.СтруктурныеЕдиницы.ФормаСписка", Новый Структура("Отбор", СтруктураОтбора));
		
	Иначе
		
		ПараметрыФормы = Новый Структура("Ключ", ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ОсновнойСклад"));
		ОткрытьФорму("Справочник.СтруктурныеЕдиницы.ФормаОбъекта", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодразделения(Команда)
	
	Если ФОУчетПоНесколькимПодразделениям Тогда
		
		СтруктураОтбора = Новый Структура("ТипСтруктурнойЕдиницы", ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Подразделение"));
		ОткрытьФорму("Справочник.СтруктурныеЕдиницы.ФормаСписка", Новый Структура("Отбор", СтруктураОтбора));
		
	Иначе
		
		ПараметрыФормы = Новый Структура("Ключ", ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ОсновноеПодразделение"));
		ОткрытьФорму("Справочник.СтруктурныеЕдиницы.ФормаОбъекта", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНаправленияДеятельности(Команда)
	
	Если ФОУчетПоНесколькимНаправлениямДеятельности Тогда
		ОткрытьФорму("Справочник.НаправленияДеятельности.ФормаСписка");
	Иначе
		ПараметрНаправлениеДеятельности = Новый Структура("Ключ", ПредопределенноеЗначение("Справочник.НаправленияДеятельности.ОсновноеНаправление"));
		ОткрытьФорму("Справочник.НаправленияДеятельности.ФормаОбъекта", ПараметрНаправлениеДеятельности);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодписиФизическийЛиц(Команда)
	
	ОткрытьФорму("Справочник.Подписи.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСлужбыДоставки(Команда)
	
	ОткрытьФорму("Справочник.СлужбыДоставки.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПараметрыРасчетовДоставки(Команда)
	
	ОткрытьФорму("Справочник.ПараметрыРасчетовДоставки.Форма.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКомиссии(Команда)
	
	ОткрытьФорму("Справочник.Комиссии.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТранспортныеСредства(Команда)
	
	ОткрытьФорму("Справочник.ТранспортныеСредства.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыЦен(Команда)
	
	ОткрытьФорму("Справочник.ВидыЦен.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыЦенКонтрагентов(Команда)
	
	ОткрытьФорму("Справочник.ВидыЦенКонтрагентов.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ПрайсЛистОрганизации(Команда)
	
	ОткрытьФорму("Справочник.ПрайсЛисты.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ПрайсЛистыКонтрагентов(Команда)
	
	ОткрытьФорму("Справочник.ПрайсЛистыКонтрагентов.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкиАнализаБизнеса(Команда)
	
	ОткрытьФорму("Справочник.КарточкиАнализаБизнеса.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьФОСервер(ИмяФункциональнойОпции)
	
	Возврат ПолучитьФункциональнуюОпцию(ИмяФункциональнойОпции);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьХранилищеШаблонов(Команда)
	ОткрытьФорму("Справочник.ХранилищеШаблонов.ФормаСписка",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьШаблоныЗаполненияГрафиковРабочегоВремени(Команда)
	ОткрытьФорму("Справочник.ШаблоныЗаполненияГрафиковРабочегоВремени.ФормаСписка",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГрафикиРаботы(Команда)
	ПараметрыФормы = Новый Структура("Подсистема", 2);
	ОткрытьФорму("Справочник.ГрафикиРаботы.ФормаСписка",ПараметрыФормы,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНеснижаемыеОстатки(Команда)
	ОткрытьФорму("РегистрСведений.НеснижаемыеОстаткиДенежныхСредств.ФормаСписка",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНоменклатуруПоставщиков(Команда)
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.НоменклатураПоставщиков.ФормаСписка",ПараметрыФормы,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаШтрихКоды(Команда)
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("РегистрСведений.ШтрихкодыНоменклатуры.ФормаСписка",ПараметрыФормы,ЭтотОбъект);
КонецПроцедуры

#КонецОбласти
